org.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>org.org</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="org.org"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-01-15 Wed"/>
<meta name="author" content="Gunter Liszewski (bs)"/>
<meta name="description" content="Org-mode re-visit, and literate, all, in an evening"/>
<meta name="keywords" content="Literate, Coding, ECMAscript, Emacs, Lisp"/>

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="http://purl.org/Gunter.Liszewski/dev/"> UP </a>
 |
 <a accesskey="H" href="http://rCooDr.github.org"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">org.org</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 RE-re-view and Literate Org-organisating</a>
<ul>
<li><a href="#sec-1-1">1.1 Code Blocks</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 An ECMAscript Example</a></li>
<li><a href="#sec-1-1-2">1.1.2 Object Principles: resuse, and extend</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Emacs Lisp mode Source example</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Lisp Example</a></li>
<li><a href="#sec-1-2-2">1.2.2 Org Mode Drawers</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Org Mode Concepts related with Coding</a>
<ul>
<li><a href="#sec-2-1">2.1 Tangling</a></li>
<li><a href="#sec-2-2">2.2 Weaving</a></li>
<li><a href="#sec-2-3">2.3 Templates</a></li>
</ul>
</li>
<li><a href="#sec-3">3 Here is one example to use the MathJax</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> RE-re-view and Literate Org-organisating</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Code Blocks</h3>
<div class="outline-text-3" id="text-1-1">


<p>
This is about literate coding. About addressing the machine, as well
as the human. Text is 'tangled' to address the machine. Addressing the
human reader's understanding can be eased by 'weaving' the text.
</p>

</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> An ECMAscript Example</h4>
<div class="outline-text-4" id="text-1-1-1">


<p>
An coding style sometimes seen uses an anonymous function to enclose
the code. This reduces the amount of name contamination of the global,
or pre-existing context.
</p>
<p>
Object and Functions in ECMAscript are used synonymously. A function object
is a basis to use for building and extending objects.
</p>



<pre class="example"><span class="linenr">1:  </span>// A namespace enclosure
<span class="linenr">2:  </span>var w = (function () {
<span class="linenr">3:  </span>    var w = function () {};
<span class="linenr">4:  </span>    return w;
<span class="linenr">5:  </span>})()
</pre>

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Object Principles: resuse, and extend</h4>
<div class="outline-text-4" id="text-1-1-2">





<pre class="example"><span class="linenr">6:  </span>w.extend = function (O, extension) {
<span class="linenr">7:  </span>    for (var p in extension)
<span class="linenr">8:  </span>        O[p] = extension[p];
<span class="linenr">9:  </span>    };
</pre>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Emacs Lisp mode Source example</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Lisp Example</h4>
<div class="outline-text-4" id="text-1-2-1">




<pre class="example"><span class="linenr">1:  </span>(+ 1 2 3)
</pre>


</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Org Mode Drawers</h4>
<div class="outline-text-4" id="text-1-2-2">





<pre class="example">C-c C-x d  org-mode-insert-drawer
</pre>



</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Org Mode Concepts related with Coding</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Tangling</h3>
<div class="outline-text-3" id="text-2-1">


</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Weaving</h3>
<div class="outline-text-3" id="text-2-2">


</div>

</div>

<div id="outline-container-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Templates</h3>
<div class="outline-text-3" id="text-2-3">





<pre class="example"><span class="linenr">1:  </span>C-c '   mode switch to work with sample
<span class="linenr">2:  </span>C-c C-v e  evaluate, execute
<span class="linenr">3:  </span>&lt; s TAB    insert a template to make a script block
</pre>


</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Here is one example to use the MathJax</h2>
<div class="outline-text-2" id="text-3">





\[
\begin{equation}
x=\sqrt{q^2+3y}
\end{equation}
\]
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2014-01-15 Wed</p>
<p class="author">Author: Gunter Liszewski (bs)</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3d with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
